OpenDTEF-v1912/tutorials/lagrangian/MPPICFoam/cyclone/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp $FOAM_TUTORIALS/resources/geometry/cyclone.stl.gz constant/triSurface

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication decomposePar

runParallel MPPICFoam

#------------------------------------------------------------------------------
